Microchip-MPLAB-Harmony/csp/apps/tc/tc_compare_mode/firmware/src/packs/ATSAML10E16A_DFP/component/evsys.h
#define EVSYS_NSCHKUSER_USER_Pos              _U_(0)                                         /**< (EVSYS_NSCHKUSER Position) User 22 to be checked as non-secured */
#define EVSYS_NSCHKUSER_USER_Msk              (_U_(0x7FFFFF) << EVSYS_NSCHKUSER_USER_Pos)    /**< (EVSYS_NSCHKUSER Mask) USER */
#define EVSYS_NSCHKUSER_USER(value)           (EVSYS_NSCHKUSER_USER_Msk & ((value) << EVSYS_NSCHKUSER_USER_Pos)) 

/** \brief EVSYS register offsets definitions */
#define EVSYS_CHANNEL_REG_OFST         (0x00)         /**< (EVSYS_CHANNEL) Channel n Control Offset */
#define EVSYS_CHINTENCLR_REG_OFST      (0x04)         /**< (EVSYS_CHINTENCLR) Channel n Interrupt Enable Clear Offset */
#define EVSYS_CHINTENSET_REG_OFST      (0x05)         /**< (EVSYS_CHINTENSET) Channel n Interrupt Enable Set Offset */
#define EVSYS_CHINTFLAG_REG_OFST       (0x06)         /**< (EVSYS_CHINTFLAG) Channel n Interrupt Flag Status and Clear Offset */
#define EVSYS_CHSTATUS_REG_OFST        (0x07)         /**< (EVSYS_CHSTATUS) Channel n Status Offset */
#define EVSYS_CTRLA_REG_OFST           (0x00)         /**< (EVSYS_CTRLA) Control Offset */
#define EVSYS_SWEVT_REG_OFST           (0x04)         /**< (EVSYS_SWEVT) Software Event Offset */
#define EVSYS_PRICTRL_REG_OFST         (0x08)         /**< (EVSYS_PRICTRL) Priority Control Offset */
#define EVSYS_INTPEND_REG_OFST         (0x10)         /**< (EVSYS_INTPEND) Channel Pending Interrupt Offset */
#define EVSYS_INTSTATUS_REG_OFST       (0x14)         /**< (EVSYS_INTSTATUS) Interrupt Status Offset */
#define EVSYS_BUSYCH_REG_OFST          (0x18)         /**< (EVSYS_BUSYCH) Busy Channels Offset */
#define EVSYS_READYUSR_REG_OFST        (0x1C)         /**< (EVSYS_READYUSR) Ready Users Offset */
#define EVSYS_USER_REG_OFST            (0x120)        /**< (EVSYS_USER) User Multiplexer n Offset */
#define EVSYS_INTENCLR_REG_OFST        (0x1D4)        /**< (EVSYS_INTENCLR) Interrupt Enable Clear Offset */
#define EVSYS_INTENSET_REG_OFST        (0x1D5)        /**< (EVSYS_INTENSET) Interrupt Enable Set Offset */
#define EVSYS_INTFLAG_REG_OFST         (0x1D6)        /**< (EVSYS_INTFLAG) Interrupt Flag Status and Clear Offset */
#define EVSYS_NONSECCHAN_REG_OFST      (0x1D8)        /**< (EVSYS_NONSECCHAN) Channels Security Attribution Offset */
#define EVSYS_NSCHKCHAN_REG_OFST       (0x1DC)        /**< (EVSYS_NSCHKCHAN) Non-Secure Channels Check Offset */
#define EVSYS_NONSECUSER_REG_OFST      (0x1E0)        /**< (EVSYS_NONSECUSER) Users Security Attribution Offset */
#define EVSYS_NSCHKUSER_REG_OFST       (0x1F0)        /**< (EVSYS_NSCHKUSER) Non-Secure Users Check Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief CHANNEL register API structure */
typedef struct
{
  __IO  uint32_t                       EVSYS_CHANNEL;   /**< Offset: 0x00 (R/W  32) Channel n Control */
  __IO  uint8_t                        EVSYS_CHINTENCLR; /**< Offset: 0x04 (R/W  8) Channel n Interrupt Enable Clear */
  __IO  uint8_t                        EVSYS_CHINTENSET; /**< Offset: 0x05 (R/W  8) Channel n Interrupt Enable Set */
  __IO  uint8_t                        EVSYS_CHINTFLAG; /**< Offset: 0x06 (R/W  8) Channel n Interrupt Flag Status and Clear */
  __I   uint8_t                        EVSYS_CHSTATUS;  /**< Offset: 0x07 (R/   8) Channel n Status */
} evsys_channel_registers_t;

#define CHANNEL_NUMBER _U_(8)

/** \brief EVSYS register API structure */
typedef struct
{  /* Event System Interface */
  __O   uint8_t                        EVSYS_CTRLA;     /**< Offset: 0x00 ( /W  8) Control */
  __I   uint8_t                        Reserved1[0x03];
  __O   uint32_t                       EVSYS_SWEVT;     /**< Offset: 0x04 ( /W  32) Software Event */
  __IO  uint8_t                        EVSYS_PRICTRL;   /**< Offset: 0x08 (R/W  8) Priority Control */
  __I   uint8_t                        Reserved2[0x07];
  __IO  uint16_t                       EVSYS_INTPEND;   /**< Offset: 0x10 (R/W  16) Channel Pending Interrupt */
  __I   uint8_t                        Reserved3[0x02];
  __I   uint32_t                       EVSYS_INTSTATUS; /**< Offset: 0x14 (R/   32) Interrupt Status */
  __I   uint32_t                       EVSYS_BUSYCH;    /**< Offset: 0x18 (R/   32) Busy Channels */
  __I   uint32_t                       EVSYS_READYUSR;  /**< Offset: 0x1C (R/   32) Ready Users */
        evsys_channel_registers_t      CHANNEL[CHANNEL_NUMBER]; /**< Offset: 0x20  */
  __I   uint8_t                        Reserved4[0xC0];
  __IO  uint8_t                        EVSYS_USER[23];  /**< Offset: 0x120 (R/W  8) User Multiplexer n */
  __I   uint8_t                        Reserved5[0x9D];
  __IO  uint8_t                        EVSYS_INTENCLR;  /**< Offset: 0x1D4 (R/W  8) Interrupt Enable Clear */
  __IO  uint8_t                        EVSYS_INTENSET;  /**< Offset: 0x1D5 (R/W  8) Interrupt Enable Set */
  __IO  uint8_t                        EVSYS_INTFLAG;   /**< Offset: 0x1D6 (R/W  8) Interrupt Flag Status and Clear */
  __I   uint8_t                        Reserved6[0x01];
  __IO  uint32_t                       EVSYS_NONSECCHAN; /**< Offset: 0x1D8 (R/W  32) Channels Security Attribution */
  __IO  uint32_t                       EVSYS_NSCHKCHAN; /**< Offset: 0x1DC (R/W  32) Non-Secure Channels Check */
  __IO  uint32_t                       EVSYS_NONSECUSER[1]; /**< Offset: 0x1E0 (R/W  32) Users Security Attribution */
  __I   uint8_t                        Reserved7[0x0C];
  __IO  uint32_t                       EVSYS_NSCHKUSER[1]; /**< Offset: 0x1F0 (R/W  32) Non-Secure Users Check */
} evsys_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAML10_EVSYS_COMPONENT_H_ */
